{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hey",
                "Is anyone there?",
                "Hello",
                "Hay",
                "Hola"
            ],
            "responses": [
                "Hello! I'm Ashe, your Research Navibot at the U. I'm named after Dr. Bowman Foster Ashe, the first president of the University!",
                "Hi! I'm Ashe, a bot here to help with University research questions. I'm named after Dr. Bowman Foster Ashe, the first president of the U.",
                "Hi there! My name is Ashe. I've been trained to answer questions about research at the U."
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye",
                "Good bye",
                "I am done",
                "Bye Bye",
                "I am going now"
            ],
            "responses": [
                "See you later! I'm a bot who's always hoping to improve. Please email vprs@miami.edu to let us know about your experience with me.",
                "Have a nice day! I'm a bot who's always hoping to improve. Please email vprs@miami.edu to let us know about your experience with me.",
                "Bye! Come back again! I'm a bot who's always hoping to improve. Please email vprs@miami.edu to let us know about your experience with me."
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "That's helpful",
                "Thanks for the help"
            ],
            "responses": [
                "Happy to help! If you have suggestions on how I can improve, please email vprs@miami.edu.",
                "Any time! If you have suggestions on how I could be more helpful, please email vprs@miami.edu.",
                "My pleasure! If you have suggestions on how I could be more helpful, please email vprs@miami.edu.",
                "You're most welcome! If you have suggestions on how I could be more helpful, please email vprs@miami.edu."
            ]
        },
        {
            "tag": "about",
            "patterns": [
                "Who are you?",
                "What are you?",
                "Who you are?"
            ],
            "responses": [
                "I'm Ashe, your Research Navibot at the U",
                "I'm Ashe, a bot here to help with University research questions.",
                "My name is Ashe. I've been trained to answer questions about research at the U"
            ]
        },
        {
            "tag": "name",
            "patterns": [
                "what is your name",
                "what should I call you",
                "whats your name?"
            ],
            "responses": [
                "You can call me Ashe.",
                "I'm Ashe!",
                "My name is Ashe",
                "I'm Ashe, pleased to meet you!"
            ]
        },
        {
            "tag": "help",
            "patterns": [
                "Could you help me?",
                "help",
                "help me",
                "give me a hand please",
                "Can you help?",
                "What can you do for me?",
                "I need some help",
                "I need help",
                "support me please?"
            ],
            "responses": [
                "I'm happy to help. How can I assist you?",
                "Absolutely! Tell me what information you need.",
                "Of course, how can I support you?"
            ]
        },
        {
            "tag": "viceprovost",
            "patterns": [
                "Who is the Vice Provost",
                "vice provost",
                "What is the Vice Provost's name",
                "who is in charge",
                "who leads research"
            ],
            "responses": [
                "The Vice Provost for Research + Scholarship is Dr. Erin Kobetz, PhD, MPH. ",
                "Erin Kobetz, PhD, MPH is the Vice Provost for Research + Scholarship.",
                "The Vice Provost for Research + Scholarship leads several research-enabling functions at the U."
            ]
        },
        {
            "tag": "vprsgeneral",
            "patterns": [
                "what is under vice provost",
                "what is vprs",
                "who works for vice provost",
                "what is research and scholarship",
                "what is this office"
            ],
            "responses": [
                "The VPRS oversees several divisions that focus on Research + Scholarship, including Research Development and Evaluation, Research Intelligence, Research Capacity & Operations, Research Administration, and Regulatory Affairs and Assessment.",
                "The VPRS oversees many aspects of Research + Scholarship at the U, from helping find a team and funding to resources for animal studies and human subjects research. Learn more in 'About Research at the University' in the top navigation bar.",
                "We have lots of information to help you navigate the office in the VPRS. Check them out in Research at the University > OVPRS Administrative Areas."
            ]
        },
        {
            "tag": "researchadmin",
            "patterns": [
                "what is ORA",
                "where is ORA",
                "help with ORA",
                "i need to talk to ORA",
                "what is research administration",
                "what is office of research administration",
                "ora",
                "research administration"
            ],
            "responses": [
                "Research Administration at the U helps researchers with sponsored proposals, contract negotiations, and managing sponsored funds. Find them at ora.miami.edu.",
                "Research Administration has experts working on pre-award, contract negotiations, and post-award management. Find them at ora.miami.edu.",
                "Research Administration helps with all financial aspects of applying for and managing grants, and is the entity that approves billing rates for the University. Find them at ora.miami.edu."
            ]
        },
        {
            "tag": "researchdevelopment",
            "patterns": [
                "internal funding",
                "get internal funding",
                "i need start-up funding",
                "internal grant",
                "fellowships"
            ],
            "responses": [
                "Our Research Development and Evalution team manages internal funding mechanisms, including the Provost's Research Awards, Arts & Humanities Fellowships, and U-LINK. Find them in About Research at the University > OVPRS Administrative Areas."
            ]
        },
        {
            "tag": "provostsawards",
            "patterns": [
                "provost's awards",
                "provost's research awards",
                "pra",
                "apply to pra",
                "apply for provost award",
                "apply for research award"
            ],
            "responses": [
                "To find out more about the Provost's Research Awards, visit About Research at the University > OVPRS Administrative Areas > Research Development and Evaluation"
            ]
        },
        {
            "tag": "loginproblems",
            "patterns": [
                "i have an it problem",
                "having trouble with log in",
                "having trouble with login",
                "need help with program",
                "need help with system",
                "cannot log in",
                "need access to program",
                "program not working"
            ],
            "responses": [
                "Our Research IT division supports users of research applications, including ePROST, Complion and UDisclose. Email their support system at resinfo@med.miami.edu to create a ticket."
                
            ]
        },
        {
            "tag": "animalstudies",
            "patterns": [
                "need to order animals",
                "animal facilities",
                "research with animals",
                "mice",
                "lab animals"
            ],
            "responses": [
                "The Division of Veterinary Resources manages requests for animals for use in research. Learn more here: https://research.miami.edu/about/admin-areas/rco/dvr/index.html",
                "Our Division of Veterinary Resources cares for all the animals we use in research. Learn more here: https://research.miami.edu/about/admin-areas/rco/dvr/index.html"
            ]
        
        },
        {
            "tag": "dadjokes",
            "patterns": [
                "tell me a joke",
                "do you know jokes",
                "i need a laugh",
                "make me laugh"
            ],
            "responses": [
                "I'm starting to write a book about a tornado disaster...it's just a draft at the moment.",
                "What do you call a robot made of plants? ...A robotanist.",
                "I'm waiting on a joke about Miami, but it's about 15 minutes late.",
                "I sold my vacuum cleaner...it was just gathering dust.",
                "Organic chemistry is difficult. Those who study it have alkynes of trouble.",
                "Anyone know any jokes about sodium? ... Na",
                "A couple of researchers had twins. They named one Jessica and the other Control.",
                "I'm reading a great book about antigravity...I just can’t put it down."

            ]
        },
        {
            "tag": "positivity",
            "patterns": [
                "i need encouragement",
                "i need inspiration",
                "i don't know what i am doing",
                "i am sad",
                "i am discouraged",
                "i don't think i can do this"
            ],
            "responses": [
                "Keep Calm and Research On",
                "You can do this! I believe in you, and I'm an intelligent bot.",
                "You are extraordinary. I know you can do this!",
                "You are in the right place! At the U, we have lots of people who can help!",
                "'When you want something, the entire universe conspires to help you achieve it.' - The Alchemist by Paulo Coehlo"
            ]
        },
        {
            "tag": "complaint",
            "patterns": [
                "have a complaint",
                "I want to raise a complaint",
                "there is a complaint about a service"
            ],
            "responses": [
                "Please provide us your complaint in order to assist you",
                "Please mention your complaint, we will reach you and sorry for any inconvenience caused"
            ]
        }
    ]
}